Билет_сервер/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

Билет_сервер/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВечерниеЧасы</name>
      <description>Вечерние часы</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Билет_сервер/src/CommonModules/Расчет/Module.bsl
// Рассчитать начисления.
// 
// Параметры:
//  Регистратор Регистратор
Процедура РассчитатьНачисления(Регистратор) Экспорт

	НаборЗаписей = РегистрыРасчета.ОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить (Регистратор);
	НаборЗаписей.Прочитать();
	
	//Оклад
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				  |	ОсновныеНачисленияДанныеГрафика.Параметр,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоЧасовФактическийПериодДействия, 0) КАК ЧасовФакт,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоЧасовПериодДействия, 0) КАК ЧасовПлан
				  |ИЗ
				  |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
				  |			Регистратор = &Регистратор
				  |				И ВидРасчета = &ВидРасчетаОклад) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);

	СтруктураПоиска=Новый СТруктура;
	СтруктураПоиска.Вставить("НомерСтроки", 0);
	Выборка=Запрос.Выполнить().Выбрать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки=Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Сторно=?(Запись.Сторно, -1, 1);
			Запись.Результат = Сторно * ?(Выборка.ЧасовПлан = 0, 0, Выборка.ЧасовФакт / Выборка.ЧасовПлан
				* Выборка.Параметр);
			Запись.ОтработаноЧасов=Сторно * Выборка.ЧасовФакт;
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;

	НаборЗаписей.Записать( , Истина);
	
	//Вечерние часы
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				  |	ОсновныеНачисленияДанныеГрафика.Параметр,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ВечернихЧасовФактическийПериодДействия, 0) КАК ВечернихЧасовФакт,
				  |	ОсновныеНачисленияДанныеГрафика.КоличествоЧасовПериодДействия КАК ЧасовПлан
				  |ИЗ
				  |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
				  |			Регистратор = &Регистратор
				  |				И ВидРасчета = &ВидРасчетаВечерниеЧасы) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВидРасчетаВечерниеЧасы", ПланыВидовРасчета.ОсновныеНачисления.ВечерниеЧасы);

	СтруктураПоиска=Новый СТруктура;
	СтруктураПоиска.Вставить("НомерСтроки", 0);
	Выборка=Запрос.Выполнить().Выбрать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки=Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Сторно=?(Запись.Сторно, -1, 1);
			Запись.Результат = Сторно * ?(Выборка.ЧасовПлан = 0, 0, Выборка.Параметр / Выборка.ЧасовПлан
				* Выборка.ВечернихЧасовФакт);
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;

	НаборЗаписей.Записать( , Истина);
	
	
	
	//Командировка
	Запрос.Текст= "ВЫБРАТЬ
				  |	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоЧасовФактическийПериодДействия, 0) КАК ЧасовФакт,
				  |	ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК База,
				  |	ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.ОтработаноЧасовБаза, 0) КАК ЧасовБаза
				  |ИЗ
				  |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
				  |			Регистратор = &Регистратор
				  |				И ВидРасчета = &ВидРасчетаКомандировка) КАК ОсновныеНачисленияДанныеГрафика
				  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(
				  |				&Измерения,
				  |				&Измерения,
				  |				,
				  |				Регистратор = &Регистратор
				  |					И ВидРасчета = &ВидРасчетаКомандировка) КАК ОсновныеНачисленияБазаОсновныеНачисления
				  |		ПО ОсновныеНачисленияДанныеГрафика.НомерСтроки = ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки";

	Измерения=Новый Массив(2);
	Измерения[0]="Сотрудник";
	Измерения[1]="Подразделение";

	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("ВидРасчетаКомандировка", ПланыВидовРасчета.ОсновныеНачисления.Командировка);

	СтруктураПоиска=Новый СТруктура;
	СтруктураПоиска.Вставить("НомерСтроки", 0);
	Выборка=Запрос.Выполнить().Выбрать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки=Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Запись.Результат = ?(Выборка.ЧасовБаза = 0, 0, Выборка.База / Выборка.ЧасовБаза * Выборка.ЧасовФакт);
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;

	НаборЗаписей.Записать( , Истина);
КонецПроцедуры
